# Concate Dataframe

In [1]:
import pandas as pd

bd_weather = pd.DataFrame({
    "city": ["Dhaka","Ctg","Rangpur"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
bd_weather

      city  temperature  humidity
0    Dhaka           32        80
1      Ctg           45        60
2  Rangpur           30        78

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [3]:
df = pd.concat([bd_weather, us_weather])
df

       city  temperature  humidity
0     Dhaka           32        80
1       Ctg           45        60
2   Rangpur           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [4]:
df = pd.concat([bd_weather, us_weather], ignore_index=True) # Ignoring index
df

       city  temperature  humidity
0     Dhaka           32        80
1       Ctg           45        60
2   Rangpur           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [5]:
df = pd.concat([bd_weather, us_weather], keys=["bd", "us"]) # Using keys is useful and good practice
df

          city  temperature  humidity
bd 0     Dhaka           32        80
   1       Ctg           45        60
   2   Rangpur           30        78
us 0  new york           21        68
   1   chicago           14        65
   2   orlando           35        75

In [6]:
df.loc["us"]                            #This is how we can get back to our previous dataframe

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
temperature_df = pd.DataFrame({
    "city": ["Dhaka","Ctg","Rangpur"],
    "temperature": [32,45,30],
}, index=[0,1,2])                   # Defining index is helpful for unsorted row names
temperature_df

      city  temperature
0    Dhaka           32
1      Ctg           45
2  Rangpur           30

In [8]:
windspeed_df = pd.DataFrame({
    "city": ["Ctg","Dhaka"],
    "windspeed": [7,12],
}, index=[1,0])                     # Keeping index similar as previous dataset # target: useful concatation
windspeed_df

    city  windspeed
1    Ctg          7
0  Dhaka         12

In [9]:
df = pd.concat([temperature_df,windspeed_df],axis=1) # by default, axis=0; oncate two dataframe by rows
df                                                   # axis=1, it will concate two dataframe by columns

      city  temperature   city  windspeed
0    Dhaka           32  Dhaka       12.0
1      Ctg           45    Ctg        7.0
2  Rangpur           30    NaN        NaN

In [10]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [11]:
df = pd.concat([temperature_df,s],axis=1)          # Using pandas series in concate
df

      city  temperature  event
0    Dhaka           32  Humid
1      Ctg           45    Dry
2  Rangpur           30   Rain